[
  {
    "_id": "PMC2699109",
    "text": "Genes having experimental data are labeled in red. Since members of all represented branches have “GO:0003918 DNA topoisomerase (ATP-hydrolyzing) activity” and a role in “GO:0007059 chromosome segregation”, the common ancestor (CA) can be inferred to also have had these functions. We thus predict that all descendents can be annotated to those terms with reasonable confidence. The sequences represented are (from top to bottom): A. thaliana TAIR:locus = 2075765, E. coli UniProt: P0AFI2 (parC), E. coli UniProt: P0AES4 (gyrA), E. coli UniProt: P20083 (parE), E. coli UniProt: P0AES6 (gyrB), A. thaliana TAIR:locus = 2146658, A. thaliana TAIR:locus = 2076268, A. thaliana TAIR:locus = 2146698, A. thaliana TAIR:locus = 2076201, D. discoideum dictyBase: DDB_G0279737 (top2mt), D. discoideum dictyBase: DDB_ G0270418 (top2), S. cerevisiae SGD:S000005032 (TOP2), S. pombe GeneDB SPBC1A4.03c (top2), D. melanogaster FlyBase FBgn0003732 (top2), C. elegans WormBase WBGene00019876 (R05D3.1), C. elegans WormBase WBGene00022854 (cin-4), C. elegans WormBase WBGene00021604 (Y46H3C.4), D. reiro ZFIN ZDB-GENE-030131-2453 (top2A), D. reiro ZFIN ZDB-GENE-041008-136 (top2B), G. gallus UniProt:O42130 (top2A), H. sapiens UniProt:P11288 (top2A), M. musculus MGI:98790 (top2A), R. norvegius RGD: 62048 (top2A), G. gallus UniProt: O42131 (top2B), H. sapiens UniProt:P02880 (top2B), M. musculus MGI:98791 (top2B), R. norvegius RGD: 1586156 (top2B)."
  },
  {
    "_id": "PMC7852309",
    "text": "Since it is well known that flies also have a large number of ECM proteins that do not have mammalian orthologs (see Introduction), we next used the UniProt Drosophila reference proteome (downloaded August 10, 2017) [76] to further expand our search for matrisome components (Supplementary Table 3A). Taking advantage of the conserved domain-based nature of ECM proteins [12], we selected InterPro domains [77] which were previously used to identify human and mouse matrisome proteins [9,10], including domains characteristic of collagens, proteoglycans, and ECM-affiliated proteins, to search for ECM-domain-containing proteins in the Drosophila proteome (Supplementary Table 4A). We also included in the search three domains characteristic of proteins involved in the production and maintenance of chitin-based ECMs: insect cuticle protein (IPR000618), chitin-binding domain (IPR002557), and chitin-binding type R&R consensus (IPR031311) [78]. Although three ECM domains were initially used to search the UniProt Drosophila reference proteome, the domain chitin-binding type R&R consensus (IPR031311), a conserved motif of 35–36 amino acids identified by Rebers and Riddiford (R&R) [79,80], was found to be redundant with the domain insect cuticle protein (IPR000618) for the identification of the 213 Drosophila proteins. (Supplementary Table 4B). To complete the list of proteins composing the Drosophila cuticle we further interrogated CuticleDB, a database of structural components of arthropods identified experimentally or through protein sequence analysis [81]. This allowed us to retrieve an additional 7 genes (CG13670, CG7548, CG8541, CG8543, Cpr65Ax1, Edg91, Lcp6) that were added to the class of cuticular proteins."
  }
]